In [1]:
%load_ext sql

In [2]:
%%sql
sqlite:///CourseData.db

'Connected: @CourseData.db'

## Domain integrity

Check Data Types for tables

In [3]:
%%sql
SELECT typeof(CATALOG_ID), typeof(PROGRAM_CODE), typeof(PROGRAM_NAME),typeof(COURSE_TITLE)
FROM CATALOG_PROGRAM
limit 1;

 * sqlite:///CourseData.db
Done.

[('text', 'text', 'text', 'text')]

In [4]:
%%sql
SELECT typeof(CC_ID), typeof(COURSE_TITLE), typeof(PRE_REQS), typeof(CO_REQS),
typeof(CATALOG_ID)
FROM CATALOG_COURSE
where PRE_REQS is not null
and CO_REQS is not null
limit 1;

 * sqlite:///CourseData.db
Done.

[('integer', 'text', 'text', 'text', 'text')]

In [8]:
%%sql
SELECT typeof(CO_ID), typeof(CRN), typeof(SECTION), typeof(COURSE_TITLE),
typeof(CREDITS), typeof(TERM_NAME)
FROM COURSE_OFFERING
limit 1;

 * sqlite:///CourseData.db
Done.

[('integer', 'integer', 'text', 'text', 'text', 'text')]

In [9]:
%%sql
SELECT typeof(CM_ID), typeof(CRN), typeof(CAP), typeof(ACT),
typeof(REM), typeof(SECTION), typeof(TERM_NAME)
FROM COURSE_MEETING
limit 1;

 * sqlite:///CourseData.db
Done.

[('integer', 'integer', 'integer', 'integer', 'integer', 'text', 'text')]

In [10]:
%%sql
SELECT typeof(ROOM_ID), typeof(Room_No), typeof(CRN), typeof(TERM_NAME)
FROM LOCATION
limit 1;

 * sqlite:///CourseData.db
Done.

[('integer', 'text', 'integer', 'text')]

In [12]:
%%sql
SELECT typeof(TERM_ID), typeof(TERM_NAME)
FROM TERM
limit 1;

 * sqlite:///CourseData.db
Done.

[('integer', 'text')]

In [14]:
%%sql
SELECT typeof(TIME_ID), typeof(START_TIME), typeof(END_TIME), typeof(CRN), typeof(TERM_NAME)
FROM TIME_CODE
limit 1;

 * sqlite:///CourseData.db
Done.

[('integer', 'text', 'text', 'integer', 'text')]

In [13]:
%%sql
SELECT typeof(I_ID), typeof(NAME), typeof(COURSE_TITLE), typeof(CRN), typeof(TERM_NAME)
FROM INSTRUCTOR
limit 1;

 * sqlite:///CourseData.db
Done.

[('integer', 'text', 'text', 'integer', 'text')]

## Entity integrity

Check for duplicates in tables

In [15]:
%%sql
SELECT COUNT(CATALOG_ID)
FROM CATALOG_PROGRAM;

 * sqlite:///CourseData.db
Done.

[(2220,)]

In [16]:
%%sql
SELECT DISTINCT COUNT(CATALOG_ID)
FROM CATALOG_PROGRAM;

 * sqlite:///CourseData.db
Done.

[(2220,)]

In [17]:
%%sql
SELECT COUNT(CC_ID)
FROM CATALOG_COURSE;

 * sqlite:///CourseData.db
Done.

[(2220,)]

In [18]:
%%sql
SELECT DISTINCT COUNT(CC_ID)
FROM CATALOG_COURSE;

 * sqlite:///CourseData.db
Done.

[(2220,)]

In [19]:
%%sql
SELECT COUNT(COURSE_TITLE)
FROM COURSE_OFFERING;

 * sqlite:///CourseData.db
Done.

[(14330,)]

In [20]:
%%sql
SELECT DISTINCT COUNT(COURSE_TITLE)
FROM COURSE_OFFERING;

 * sqlite:///CourseData.db
Done.

[(14330,)]

In [21]:
%%sql
SELECT COUNT(CM_ID)
FROM COURSE_MEETING;

 * sqlite:///CourseData.db
Done.

[(14330,)]

In [22]:
%%sql
SELECT DISTINCT COUNT(CM_ID)
FROM COURSE_MEETING;

 * sqlite:///CourseData.db
Done.

[(14330,)]

In [23]:
%%sql
SELECT COUNT(Room_No)
FROM Location;

 * sqlite:///CourseData.db
Done.

[(13032,)]

In [24]:
%%sql
SELECT DISTINCT COUNT(Room_No)
FROM Location;

 * sqlite:///CourseData.db
Done.

[(13032,)]

In [28]:
%%sql
SELECT COUNT(TERM_NAME)
FROM Term;

 * sqlite:///CourseData.db
Done.

[(19,)]

In [29]:
%%sql
SELECT DISTINCT COUNT(TERM_NAME)
FROM Term;

 * sqlite:///CourseData.db
Done.

[(19,)]

In [30]:
%%sql
SELECT COUNT(Name)
FROM Instructor;

 * sqlite:///CourseData.db
Done.

[(14330,)]

In [31]:
%%sql
SELECT DISTINCT COUNT(Name)
FROM Instructor;

 * sqlite:///CourseData.db
Done.

[(14330,)]

In [32]:
%%sql
SELECT COUNT(CRN)
FROM Time_Code;

 * sqlite:///CourseData.db
Done.

[(296781,)]

In [33]:
%%sql
SELECT DISTINCT COUNT(CRN)
FROM Time_Code;

 * sqlite:///CourseData.db
Done.

[(296781,)]

## Relational integrity

Foreign Keys Joins compatible with the Primary Keys

In [34]:
%%sql
SELECT *
FROM CATALOG_PROGRAM a, CATALOG_COURSE b
WHERE a.CATALOG_ID=b.CATALOG_ID
limit 1;

 * sqlite:///CourseData.db
Done.

[('AN 0301', 'AN', 'Asian Studies', 'Independent Study', 1, 'Independent Study', None, None, 'AN 0301')]

In [35]:
%%sql
SELECT *
FROM CATALOG_COURSE a, COURSE_OFFERING b
WHERE a.COURSE_TITLE=b.COURSE_TITLE
limit 1;

 * sqlite:///CourseData.db
Done.

[(1, 'Independent Study', None, None, 'AN 0301', 6629, 11628, 'DG', 'Independent Study', '1.000', 'Winter2016')]

In [37]:
%%sql
SELECT *
FROM COURSE_OFFERING a, TERM b
WHERE a.TERM_NAME=b.TERM_NAME
limit 1;

 * sqlite:///CourseData.db
Done.

[(63, 70001, 'A', 'Ethics of Health Care', '3.000', 'Fall2014', 1, 'Fall2014')]

In [38]:
%%sql
SELECT *
FROM COURSE_OFFERING a, INSTRUCTOR b
WHERE a.CRN=b.CRN
limit 1;

 * sqlite:///CourseData.db
Done.

[(1, 70384, 'C01', 'Introduction to Financial Accounting', '3.000', 'Fall2014', 1, 'Michael P.  Coyne', 'Introduction to Financial Accounting', 70384, 'Fall2014')]

In [39]:
%%sql
SELECT *
FROM COURSE_OFFERING a, COURSE_MEETING b
WHERE a.SECTION=b.SECTION
limit 1;

 * sqlite:///CourseData.db
Done.

[(1, 70384, 'C01', 'Introduction to Financial Accounting', '3.000', 'Fall2014', 377, 70015, 0, 19, -19, 'C01', 'Fall2014')]

In [40]:
%%sql
SELECT *
FROM COURSE_OFFERING a, TIME_CODE b
WHERE a.CRN=b.CRN
limit 1;

 * sqlite:///CourseData.db
Done.

[(1, 70384, 'C01', 'Introduction to Financial Accounting', '3.000', 'Fall2014', 1, '2014-09-02T08:00:00', '2014-09-02T09:15:00', 70384, 'Fall2014')]

In [41]:
%%sql
SELECT *
FROM COURSE_MEETING a, LOCATION b
WHERE a.CRN=b.CRN
limit 1;

 * sqlite:///CourseData.db
Done.

[(1, 70384, 0, 31, -31, 'C01', 'Fall2014', 1, 'DSB 105', 70384, 'Fall2014')]

#### We Noticed Muliple CRNs across Terms

Which is why we went back in and changed our ERDs to include CRN and Term as unique

In [42]:
%%sql
select *
from course_meeting
where crn = 31888

 * sqlite:///CourseData.db
Done.

[(7870, 31888, 0, 7, -7, '01', 'Spring2015'),
 (9616, 31888, 15, 12, 3, '01', 'Spring2017')]

In [43]:
%%sql
select *
from course_offering
where crn = 31888

 * sqlite:///CourseData.db
Done.

[(7870, 31888, '01', 'Curriculum and Methods for Students with Mild to Moderate Disabilities', '3.000', 'Spring2015'),
 (9616, 31888, '01', 'Teaching and Writing', '3.000', 'Spring2017')]